applications/tutorials/pyromultiphaseEulerFoam/pelletTest/0.orig/Hcell.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Hcell.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/globalVars"

dimensions      [0 0 0 0 0 0 0];

internalField   uniform $FBR_HcellFrac;

boundaryField
{
    gasinlet
    {
        type            zeroGradient;
    }
    solidsinlet
    {
        type            fixedValue;
        value           uniform $FBR_HcellFrac;
    }
    outlet
    {
        type            zeroGradient;
    }
    pyrowall
    {
        type            zeroGradient;
    }
    adwall
    {
        type            zeroGradient;
    }
    frontback
    {
        type            empty;
    }
}


// ************************************************************************* //
