applications/tutorials/pyromultiphaseEulerFoam/pelletTest/0.orig/N2.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      AIR.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    gasinlet
    {
        type            fixedValue;
        value           uniform 1.0;
    }
    solidsinlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    pyrowall
    {
        type            zeroGradient;
    }
    adwall
    {
        type            zeroGradient;
    }
    frontback
    {
        type            empty;
    }
}


// ************************************************************************* //
