applications/tutorials/pyromultiphaseEulerFoam/pelletTest/0.orig/T.bed
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.bed;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/globalVars"

dimensions          [0 0 0 1 0 0 0];

internalField       uniform $FBR_SandTemp;

boundaryField
{
    gasinlet
    {
        type               zeroGradient;
    }

    solidsinlet
    {
        type               zeroGradient;
    }

    outlet
    {
        type               zeroGradient;
    }
    
    pyrowall
    {
        //type                 zeroGradient;
        type               fixedValue;
        value              uniform $FBR_WallTemp;
    }
    
    adwall
    {
        type               zeroGradient;
    }

    frontback
    {
        type               empty;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
