applications/tutorials/pyromultiphaseEulerFoam/pelletTest/0.orig/Theta.bed
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Theta.bed;
}
// ************************************************************************* //

dimensions          [0 2 -2 0 0 0 0];

internalField       uniform 0;

referenceLevel      1e-4;

boundaryField
{
    gasinlet
    {
        type               fixedValue;
        value              uniform 1e-4;
    }
    
    solidsinlet
    {
        type               fixedValue;
        value              uniform 1e-4;
    }

    outlet
    {
        type               zeroGradient;
    }

    pyrowall
    {
        type               JohnsonJacksonParticleTheta;
        restitutionCoefficient 0.8;
        specularityCoefficient 0.01;
        value              uniform 1e-4;
        //type               zeroGradient;
    }
    
    adwall
    {
        type               zeroGradient;
    }

    frontback
    {
        type               empty;
    }
}

// ************************************************************************* //
