applications/tutorials/pyromultiphaseEulerFoam/pelletTest/0.orig/alpha.bed
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.bed;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    gasinlet
    {
        type   zeroGradient;
    }
    
    solidsinlet
    {
        type  fixedValue;
        value uniform 0;
    }

    outlet
    {
        type            zeroGradient;
    }

    pyrowall
    {
        type            zeroGradient;
    }
    
    adwall
    {
        type            zeroGradient;
    }

    frontback
    {
        type            empty;
    }
}

// ************************************************************************* //
