applications/tutorials/pyromultiphaseEulerFoam/pelletTest/0.orig/alphat.bed
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat.bed;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    gasinlet
    {
        type            calculated;
        value           $internalField;
    }

    solidsinlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    pyrowall
    {
        type            calculated;
        value           $internalField;
    }
    
    adwall
    {
        type            calculated;
        value           $internalField;
    }

    frontback
    {
        type            empty;
    }
}

// ************************************************************************* //
