applications/tutorials/pyromultiphaseEulerFoam/pelletTest/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/globalVars"

dist #calc "2.0*$FBR_Dia";
mdist #calc "-$dist /1.5";
pdist #calc "$dist /1.5";
bottom #calc "0.25*$FBR_BedHt";

defaultFieldValues
(
    volScalarFieldValue alpha.gas 1.0
    volScalarFieldValue alpha.bed 0.0
    volScalarFieldValue alpha.particles 0.0
);

regions
(
    boxToCell
    {
        box (-10 0.01 $bottom) (10 0.04 $FBR_BedHt);
        fieldValues
        (
            volScalarFieldValue alpha.gas $FBR_BedGas
            volScalarFieldValue alpha.bed $FBR_BedSand
            volScalarFieldValue alpha.particles $FBR_BedPart
        );
    }
);


// ************************************************************************* //
