applications/tutorials/pyromultiphaseEulerFoam/pelletTest/Allrun
#!/bin/sh
blockMesh
cp -r 0.orig 0
setFields
#pyromultiphaseEulerFoam
